nurazur/TiNo2/boards.txt
menu.clock=Clock
menu.BOD=BOD
menu.eeprom=EEPROM
menu.pinout=Pinout
menu.resetpin=Reset pin
menu.bootloader=Bootloader

###################################
#### TiNo2 Sender (ATMEGA 4808)####
###################################

# General
TiNo2_Sender.name=TiNo2 (Atmega4808)
TiNo2_Sender.upload.tool=MegaCoreX:avrdude
TiNo2_Sender.upload.maximum_data_size=6144
TiNo2_Sender.upload.speed=115200
TiNo2_Sender.bootloader.tool=MegaCoreX:avrdude
TiNo2_Sender.build.core=MegaCoreX:coreX-corefiles
TiNo2_Sender.build.board=AVR_ATmega4808
TiNo2_Sender.build.mcu=atmega4808
TiNo2_Sender.build.extra_flags={build.oscillator}
TiNo2_Sender.build.variant=32pin-standard

# Fuses we don't need to modify in the tools menu
TiNo2_Sender.bootloader.WDTCFG=0x00
TiNo2_Sender.bootloader.TCD0CFG=0x00
TiNo2_Sender.bootloader.SYSCFG1=0x06
TiNo2_Sender.bootloader.APPEND=0x00
TiNo2_Sender.bootloader.LOCKBIT=0xC5

# EEPROM
TiNo2_Sender.menu.eeprom.keep=EEPROM retained
TiNo2_Sender.menu.eeprom.keep.bootloader.eesave_bit=1
TiNo2_Sender.menu.eeprom.erase=EEPROM not retained
TiNo2_Sender.menu.eeprom.erase.bootloader.eesave_bit=0
TiNo2_Sender.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}

# Brown out detection
TiNo2_Sender.menu.BOD.disabled=BOD disabled
TiNo2_Sender.menu.BOD.disabled.bootloader.BODCFG=0x00
TiNo2_Sender.menu.BOD.1v8=BOD 1.8V
TiNo2_Sender.menu.BOD.1v8.bootloader.BODCFG=0x14
TiNo2_Sender.menu.BOD.2v6=BOD 2.6V
TiNo2_Sender.menu.BOD.2v6.bootloader.BODCFG=0x54
TiNo2_Sender.menu.BOD.4v3=BOD 4.3V
TiNo2_Sender.menu.BOD.4v3.bootloader.BODCFG=0xF4
#TiNo2_Sender.menu.BOD.4v0=BOD 4.0V
#TiNo2_Sender.menu.BOD.4v0.bootloader.BODCFG=0xD4
#TiNo2_Sender.menu.BOD.3v7=BOD 3.7V
#TiNo2_Sender.menu.BOD.3v7.bootloader.BODCFG=0xB4
#TiNo2_Sender.menu.BOD.3v3=BOD 3.3V
#TiNo2_Sender.menu.BOD.3v3.bootloader.BODCFG=0x94
#TiNo2_Sender.menu.BOD.2v9=BOD 2.9V
#TiNo2_Sender.menu.BOD.2v9.bootloader.BODCFG=0x74
#TiNo2_Sender.menu.BOD.2v1=BOD 2.1V
#TiNo2_Sender.menu.BOD.2v1.bootloader.BODCFG=0x34



# Clock
TiNo2_Sender.menu.clock.internal_4MHz=Internal 4 MHz
TiNo2_Sender.menu.clock.internal_4MHz.upload.speed=115200
TiNo2_Sender.menu.clock.internal_4MHz.bootloader.OSCCFG=0x01
TiNo2_Sender.menu.clock.internal_4MHz.build.oscillator=
TiNo2_Sender.menu.clock.internal_4MHz.build.f_cpu=4000000L

TiNo2_Sender.menu.clock.internal_1MHz=Internal 1 MHz
TiNo2_Sender.menu.clock.internal_1MHz.upload.speed=115200
TiNo2_Sender.menu.clock.internal_1MHz.bootloader.OSCCFG=0x01
TiNo2_Sender.menu.clock.internal_1MHz.build.oscillator=
TiNo2_Sender.menu.clock.internal_1MHz.build.f_cpu=1000000L


TiNo2_Sender.menu.clock.internal_2MHz=Internal 2 MHz
TiNo2_Sender.menu.clock.internal_2MHz.upload.speed=115200
TiNo2_Sender.menu.clock.internal_2MHz.bootloader.OSCCFG=0x01
TiNo2_Sender.menu.clock.internal_2MHz.build.oscillator=
TiNo2_Sender.menu.clock.internal_2MHz.build.f_cpu=2000000L


TiNo2_Sender.menu.clock.internal_8MHz=Internal 8 MHz
TiNo2_Sender.menu.clock.internal_8MHz.upload.speed=115200
TiNo2_Sender.menu.clock.internal_8MHz.bootloader.OSCCFG=0x01
TiNo2_Sender.menu.clock.internal_8MHz.build.oscillator=
TiNo2_Sender.menu.clock.internal_8MHz.build.f_cpu=8000000L

TiNo2_Sender.menu.clock.internal_16MHz=Internal 16 MHz
TiNo2_Sender.menu.clock.internal_16MHz.upload.speed=115200
TiNo2_Sender.menu.clock.internal_16MHz.bootloader.OSCCFG=0x01
TiNo2_Sender.menu.clock.internal_16MHz.build.oscillator=
TiNo2_Sender.menu.clock.internal_16MHz.build.f_cpu=16000000L



# Bootloader
TiNo2_Sender.menu.bootloader.uart0_default=Yes, UART0 default pins
TiNo2_Sender.menu.bootloader.uart0_default.upload.maximum_size=48640
TiNo2_Sender.menu.bootloader.uart0_default.upload.protocol=arduino
TiNo2_Sender.menu.bootloader.uart0_default.upload.port=UART0_DEF
TiNo2_Sender.menu.bootloader.uart0_default.upload.extra_params=
TiNo2_Sender.menu.bootloader.uart0_default.build.text_section_start=.text=0x200
TiNo2_Sender.menu.bootloader.uart0_default.build.export_merged_output=true
TiNo2_Sender.menu.bootloader.uart0_default.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
TiNo2_Sender.menu.bootloader.uart0_default.bootloader.BOOTEND=0x02
TiNo2_Sender.menu.bootloader.uart0_default.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}

TiNo2_Sender.menu.bootloader.no_bootloader=No
TiNo2_Sender.menu.bootloader.no_bootloader.upload.maximum_size=49152
TiNo2_Sender.menu.bootloader.no_bootloader.upload.extra_params=
TiNo2_Sender.menu.bootloader.no_bootloader.build.text_section_start=.text=0x0
TiNo2_Sender.menu.bootloader.no_bootloader.build.export_merged_output=false
TiNo2_Sender.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex
TiNo2_Sender.menu.bootloader.no_bootloader.bootloader.BOOTEND=0x00


#########################################################
#### TiNo2 Sender (ATMEGA 4808) Simple Configuration ####
#########################################################

# General
TiNo2_Send_simple.name=TiNo2 Sender Standard Config
TiNo2_Send_simple.upload.tool=MegaCoreX:avrdude
TiNo2_Send_simple.upload.maximum_data_size=6144
TiNo2_Send_simple.upload.speed=115200
TiNo2_Send_simple.bootloader.tool=MegaCoreX:avrdude
TiNo2_Send_simple.build.core=MegaCoreX:coreX-corefiles
TiNo2_Send_simple.build.board=AVR_ATmega4808
TiNo2_Send_simple.build.mcu=atmega4808
TiNo2_Send_simple.build.extra_flags={build.oscillator}
TiNo2_Send_simple.build.variant=32pin-standard

# Fuses we don't need to modify in the tools menu
TiNo2_Send_simple.bootloader.WDTCFG=0x00
TiNo2_Send_simple.bootloader.TCD0CFG=0x00
TiNo2_Send_simple.bootloader.SYSCFG1=0x06
TiNo2_Send_simple.bootloader.APPEND=0x00
TiNo2_Send_simple.bootloader.LOCKBIT=0xC5
TiNo2_Send_simple.bootloader.SYSCFG0=0b11001001
TiNo2_Send_simple.bootloader.BODCFG=0x00

# EEPROM
#TiNo2_Send_simple.menu.eeprom.keep=EEPROM retained
#TiNo2_Send_simple.menu.eeprom.keep.bootloader.eesave_bit=1
#TiNo2_Send_simple.menu.eeprom.erase=EEPROM not retained
#TiNo2_Send_simple.menu.eeprom.erase.bootloader.eesave_bit=0
#TiNo2_Send_simple.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}

# Brown out detection
#TiNo2_Send_simple.menu.BOD.disabled=BOD disabled
#TiNo2_Send_simple.menu.BOD.disabled.bootloader.BODCFG=0x00
#TiNo2_Send_simple.menu.BOD.1v8=BOD 1.8V
#TiNo2_Send_simple.menu.BOD.1v8.bootloader.BODCFG=0x14
#TiNo2_Send_simple.menu.BOD.2v6=BOD 2.6V
#TiNo2_Send_simple.menu.BOD.2v6.bootloader.BODCFG=0x54
#TiNo2_Send_simple.menu.BOD.4v3=BOD 4.3V
#TiNo2_Send_simple.menu.BOD.4v3.bootloader.BODCFG=0xF4
#TiNo2_Send_simple.menu.BOD.4v0=BOD 4.0V
#TiNo2_Send_simple.menu.BOD.4v0.bootloader.BODCFG=0xD4
#TiNo2_Send_simple.menu.BOD.3v7=BOD 3.7V
#TiNo2_Send_simple.menu.BOD.3v7.bootloader.BODCFG=0xB4
#TiNo2_Send_simple.menu.BOD.3v3=BOD 3.3V
#TiNo2_Send_simple.menu.BOD.3v3.bootloader.BODCFG=0x94
#TiNo2_Send_simple.menu.BOD.2v9=BOD 2.9V
#TiNo2_Send_simple.menu.BOD.2v9.bootloader.BODCFG=0x74
#TiNo2_Send_simple.menu.BOD.2v1=BOD 2.1V
#TiNo2_Send_simple.menu.BOD.2v1.bootloader.BODCFG=0x34



# Clock
TiNo2_Send_simple.menu.clock.internal_4MHz=Internal 4 MHz
TiNo2_Send_simple.menu.clock.internal_4MHz.upload.speed=115200
TiNo2_Send_simple.menu.clock.internal_4MHz.bootloader.OSCCFG=0x01
TiNo2_Send_simple.menu.clock.internal_4MHz.build.oscillator=
TiNo2_Send_simple.menu.clock.internal_4MHz.build.f_cpu=4000000L

TiNo2_Send_simple.menu.clock.internal_1MHz=Internal 1 MHz
TiNo2_Send_simple.menu.clock.internal_1MHz.upload.speed=115200
TiNo2_Send_simple.menu.clock.internal_1MHz.bootloader.OSCCFG=0x01
TiNo2_Send_simple.menu.clock.internal_1MHz.build.oscillator=
TiNo2_Send_simple.menu.clock.internal_1MHz.build.f_cpu=1000000L


#TiNo2_Send_simple.menu.clock.internal_2MHz=Internal 2 MHz
#TiNo2_Send_simple.menu.clock.internal_2MHz.upload.speed=115200
#TiNo2_Send_simple.menu.clock.internal_2MHz.bootloader.OSCCFG=0x01
#TiNo2_Send_simple.menu.clock.internal_2MHz.build.oscillator=
#TiNo2_Send_simple.menu.clock.internal_2MHz.build.f_cpu=2000000L


