nurazur/TiNo2/boards.txt
4808.menu.bootloader.uart1_default=Optiboot (UART1 default pins)
4808.menu.bootloader.uart1_default.upload.maximum_size=48640
4808.menu.bootloader.uart1_default.upload.protocol=arduino
4808.menu.bootloader.uart1_default.upload.port=UART1_DEF
4808.menu.bootloader.uart1_default.upload.extra_params=
4808.menu.bootloader.uart1_default.build.text_section_start=.text=0x200
4808.menu.bootloader.uart1_default.build.export_merged_output=true
4808.menu.bootloader.uart1_default.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
4808.menu.bootloader.uart1_default.bootloader.BOOTEND=0x02
4808.menu.bootloader.uart1_default.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}

4808.menu.bootloader.uart1_alternative=Optiboot (UART1 alternative pins)
4808.menu.bootloader.uart1_alternative.upload.maximum_size=48640
4808.menu.bootloader.uart1_alternative.upload.protocol=arduino
4808.menu.bootloader.uart1_alternative.upload.port=UART1_ALT
4808.menu.bootloader.uart1_alternative.upload.extra_params=
4808.menu.bootloader.uart1_alternative.build.text_section_start=.text=0x200
4808.menu.bootloader.uart1_alternative.build.export_merged_output=true
4808.menu.bootloader.uart1_alternative.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
4808.menu.bootloader.uart1_alternative.bootloader.BOOTEND=0x02
4808.menu.bootloader.uart1_alternative.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}

4808.menu.bootloader.uart2_default=Optiboot (UART2 default pins)
4808.menu.bootloader.uart2_default.upload.maximum_size=48640
4808.menu.bootloader.uart2_default.upload.protocol=arduino
4808.menu.bootloader.uart2_default.upload.port=UART2_DEF
4808.menu.bootloader.uart2_default.upload.extra_params=
4808.menu.bootloader.uart2_default.build.text_section_start=.text=0x200
4808.menu.bootloader.uart2_default.build.export_merged_output=true
4808.menu.bootloader.uart2_default.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
4808.menu.bootloader.uart2_default.bootloader.BOOTEND=0x02
4808.menu.bootloader.uart2_default.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}

4808.menu.bootloader.uart2_alternative=Optiboot (UART2 alternative pins)
4808.menu.bootloader.uart2_alternative.upload.maximum_size=48640
4808.menu.bootloader.uart2_alternative.upload.protocol=arduino
4808.menu.bootloader.uart2_alternative.upload.port=UART2_ALT
4808.menu.bootloader.uart2_alternative.upload.extra_params=
4808.menu.bootloader.uart2_alternative.build.text_section_start=.text=0x200
4808.menu.bootloader.uart2_alternative.build.export_merged_output=true
4808.menu.bootloader.uart2_alternative.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
4808.menu.bootloader.uart2_alternative.bootloader.BOOTEND=0x02
4808.menu.bootloader.uart2_alternative.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}



####################
#### ATmega3208 ####
####################

# General
3208.name=ATmega3208
3208.upload.tool=avrdude
3208.upload.maximum_data_size=4096
3208.upload.speed=115200
3208.bootloader.tool=MegaCoreX:avrdude
3208.build.core=MegaCoreX:coreX-corefiles
3208.build.board=AVR_ATmega3208
3208.build.mcu=atmega3208
3208.build.extra_flags={build.oscillator}

# Fuses we don't need to modify in the tools menu
3208.bootloader.WDTCFG=0x00
3208.bootloader.TCD0CFG=0x00
3208.bootloader.SYSCFG1=0x06
3208.bootloader.APPEND=0x00
3208.bootloader.LOCKBIT=0xC5

# Pinouts
3208.menu.pinout.32pin_standard=32 pin standard
3208.menu.pinout.32pin_standard.build.variant=32pin-standard

# EEPROM
3208.menu.eeprom.keep=EEPROM retained
3208.menu.eeprom.keep.bootloader.eesave_bit=1
3208.menu.eeprom.erase=EEPROM not retained
3208.menu.eeprom.erase.bootloader.eesave_bit=0

# Reset pin
3208.menu.resetpin.reset=Reset
3208.menu.resetpin.reset.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}
3208.menu.resetpin.gpio=GPIO
3208.menu.resetpin.gpio.bootloader.SYSCFG0=0b1100000{bootloader.eesave_bit}

# Brown out detection
3208.menu.BOD.2v6=BOD 2.6V
3208.menu.BOD.2v6.bootloader.BODCFG=0x54
3208.menu.BOD.4v3=BOD 4.3V
3208.menu.BOD.4v3.bootloader.BODCFG=0xF4
3208.menu.BOD.4v0=BOD 4.0V
3208.menu.BOD.4v0.bootloader.BODCFG=0xD4
3208.menu.BOD.3v7=BOD 3.7V
3208.menu.BOD.3v7.bootloader.BODCFG=0xB4
3208.menu.BOD.3v3=BOD 3.3V
3208.menu.BOD.3v3.bootloader.BODCFG=0x94
3208.menu.BOD.2v9=BOD 2.9V
3208.menu.BOD.2v9.bootloader.BODCFG=0x74
3208.menu.BOD.2v1=BOD 2.1V
3208.menu.BOD.2v1.bootloader.BODCFG=0x34
3208.menu.BOD.1v8=BOD 1.8V
3208.menu.BOD.1v8.bootloader.BODCFG=0x14
3208.menu.BOD.disabled=BOD disabled
3208.menu.BOD.disabled.bootloader.BODCFG=0x00

# Clock
3208.menu.clock.internal_16MHz=Internal 16 MHz
3208.menu.clock.internal_16MHz.upload.speed=115200
3208.menu.clock.internal_16MHz.bootloader.OSCCFG=0x01
3208.menu.clock.internal_16MHz.build.oscillator=
3208.menu.clock.internal_16MHz.build.f_cpu=16000000L

3208.menu.clock.internal_20MHz=Internal 20 MHz
3208.menu.clock.internal_20MHz.upload.speed=115200
3208.menu.clock.internal_20MHz.bootloader.OSCCFG=0x02
3208.menu.clock.internal_20MHz.build.oscillator=
3208.menu.clock.internal_20MHz.build.f_cpu=20000000L

3208.menu.clock.internal_10MHz=Internal 10 MHz
3208.menu.clock.internal_10MHz.upload.speed=115200
3208.menu.clock.internal_10MHz.bootloader.OSCCFG=0x02
3208.menu.clock.internal_10MHz.build.oscillator=
3208.menu.clock.internal_10MHz.build.f_cpu=10000000L

3208.menu.clock.internal_8MHz=Internal 8 MHz
3208.menu.clock.internal_8MHz.upload.speed=115200
3208.menu.clock.internal_8MHz.bootloader.OSCCFG=0x01
3208.menu.clock.internal_8MHz.build.oscillator=
3208.menu.clock.internal_8MHz.build.f_cpu=8000000L

3208.menu.clock.internal_5MHz=Internal 5 MHz
3208.menu.clock.internal_5MHz.upload.speed=115200
3208.menu.clock.internal_5MHz.bootloader.OSCCFG=0x02
3208.menu.clock.internal_5MHz.build.oscillator=
3208.menu.clock.internal_5MHz.build.f_cpu=5000000L

3208.menu.clock.internal_4MHz=Internal 4 MHz
3208.menu.clock.internal_4MHz.upload.speed=115200
3208.menu.clock.internal_4MHz.bootloader.OSCCFG=0x01
3208.menu.clock.internal_4MHz.build.oscillator=
3208.menu.clock.internal_4MHz.build.f_cpu=4000000L

3208.menu.clock.internal_2MHz=Internal 2 MHz
3208.menu.clock.internal_2MHz.upload.speed=115200
3208.menu.clock.internal_2MHz.bootloader.OSCCFG=0x01
3208.menu.clock.internal_2MHz.build.oscillator=
3208.menu.clock.internal_2MHz.build.f_cpu=2000000L

