nurazur/TiNo2/boards.txt
3208.menu.clock.internal_1MHz=Internal 1 MHz
3208.menu.clock.internal_1MHz.upload.speed=115200
3208.menu.clock.internal_1MHz.bootloader.OSCCFG=0x01
3208.menu.clock.internal_1MHz.build.oscillator=
3208.menu.clock.internal_1MHz.build.f_cpu=1000000L

3208.menu.clock.external_16MHz=External 16 MHz
3208.menu.clock.external_16MHz.upload.speed=115200
3208.menu.clock.external_16MHz.bootloader.OSCCFG=0x01
3208.menu.clock.external_16MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3208.menu.clock.external_16MHz.build.f_cpu=16000000L

3208.menu.clock.external_12MHz=External 12 MHz
3208.menu.clock.external_12MHz.upload.speed=115200
3208.menu.clock.external_12MHz.bootloader.OSCCFG=0x01
3208.menu.clock.external_12MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3208.menu.clock.external_12MHz.build.f_cpu=12000000L

3208.menu.clock.external_8MHz=External 8 MHz
3208.menu.clock.external_8MHz.upload.speed=115200
3208.menu.clock.external_8MHz.bootloader.OSCCFG=0x01
3208.menu.clock.external_8MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3208.menu.clock.external_8MHz.build.f_cpu=8000000L

3208.menu.clock.external_4MHz=External 4 MHz
3208.menu.clock.external_4MHz.upload.speed=115200
3208.menu.clock.external_4MHz.bootloader.OSCCFG=0x01
3208.menu.clock.external_4MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3208.menu.clock.external_4MHz.build.f_cpu=4000000L

3208.menu.clock.external_1MHz=External 1 MHz
3208.menu.clock.external_1MHz.upload.speed=115200
3208.menu.clock.external_1MHz.bootloader.OSCCFG=0x01
3208.menu.clock.external_1MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3208.menu.clock.external_1MHz.build.f_cpu=1000000L

# Bootloader
3208.menu.bootloader.no_bootloader=No bootloader
3208.menu.bootloader.no_bootloader.upload.maximum_size=32768
3208.menu.bootloader.no_bootloader.upload.extra_params=
3208.menu.bootloader.no_bootloader.build.text_section_start=.text=0x0
3208.menu.bootloader.no_bootloader.build.export_merged_output=false
3208.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex
3208.menu.bootloader.no_bootloader.bootloader.BOOTEND=0x00

3208.menu.bootloader.uart0_default=Optiboot (UART0 default pins)
3208.menu.bootloader.uart0_default.upload.maximum_size=32256
3208.menu.bootloader.uart0_default.upload.protocol=arduino
3208.menu.bootloader.uart0_default.upload.port=UART0_DEF
3208.menu.bootloader.uart0_default.upload.extra_params=
3208.menu.bootloader.uart0_default.build.text_section_start=.text=0x200
3208.menu.bootloader.uart0_default.build.export_merged_output=true
3208.menu.bootloader.uart0_default.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3208.menu.bootloader.uart0_default.bootloader.BOOTEND=0x02
3208.menu.bootloader.uart0_default.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}

3208.menu.bootloader.uart0_alternative=Optiboot (UART0 alternative pins)
3208.menu.bootloader.uart0_alternative.upload.maximum_size=32256
3208.menu.bootloader.uart0_alternative.upload.protocol=arduino
3208.menu.bootloader.uart0_alternative.upload.port=UART0_ALT
3208.menu.bootloader.uart0_alternative.upload.extra_params=
3208.menu.bootloader.uart0_alternative.build.text_section_start=.text=0x200
3208.menu.bootloader.uart0_alternative.build.export_merged_output=true
3208.menu.bootloader.uart0_alternative.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3208.menu.bootloader.uart0_alternative.bootloader.BOOTEND=0x02
3208.menu.bootloader.uart0_alternative.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}

3208.menu.bootloader.uart1_default=Optiboot (UART1 default pins)
3208.menu.bootloader.uart1_default.upload.maximum_size=32256
3208.menu.bootloader.uart1_default.upload.protocol=arduino
3208.menu.bootloader.uart1_default.upload.port=UART1_DEF
3208.menu.bootloader.uart1_default.upload.extra_params=
3208.menu.bootloader.uart1_default.build.text_section_start=.text=0x200
3208.menu.bootloader.uart1_default.build.export_merged_output=true
3208.menu.bootloader.uart1_default.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3208.menu.bootloader.uart1_default.bootloader.BOOTEND=0x02
3208.menu.bootloader.uart1_default.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}

3208.menu.bootloader.uart1_alternative=Optiboot (UART1 alternative pins)
3208.menu.bootloader.uart1_alternative.upload.maximum_size=32256
3208.menu.bootloader.uart1_alternative.upload.protocol=arduino
3208.menu.bootloader.uart1_alternative.upload.port=UART1_ALT
3208.menu.bootloader.uart1_alternative.upload.extra_params=
3208.menu.bootloader.uart1_alternative.build.text_section_start=.text=0x200
3208.menu.bootloader.uart1_alternative.build.export_merged_output=true
3208.menu.bootloader.uart1_alternative.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3208.menu.bootloader.uart1_alternative.bootloader.BOOTEND=0x02
3208.menu.bootloader.uart1_alternative.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}

3208.menu.bootloader.uart2_default=Optiboot (UART2 default pins)
3208.menu.bootloader.uart2_default.upload.maximum_size=32256
3208.menu.bootloader.uart2_default.upload.protocol=arduino
3208.menu.bootloader.uart2_default.upload.port=UART2_DEF
3208.menu.bootloader.uart2_default.upload.extra_params=
3208.menu.bootloader.uart2_default.build.text_section_start=.text=0x200
3208.menu.bootloader.uart2_default.build.export_merged_output=true
3208.menu.bootloader.uart2_default.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3208.menu.bootloader.uart2_default.bootloader.BOOTEND=0x02
3208.menu.bootloader.uart2_default.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}

3208.menu.bootloader.uart2_alternative=Optiboot (UART2 alternative pins)
3208.menu.bootloader.uart2_alternative.upload.maximum_size=32256
3208.menu.bootloader.uart2_alternative.upload.protocol=arduino
3208.menu.bootloader.uart2_alternative.upload.port=UART2_ALT
3208.menu.bootloader.uart2_alternative.upload.extra_params=
3208.menu.bootloader.uart2_alternative.build.text_section_start=.text=0x200
3208.menu.bootloader.uart2_alternative.build.export_merged_output=true
3208.menu.bootloader.uart2_alternative.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3208.menu.bootloader.uart2_alternative.bootloader.BOOTEND=0x02
3208.menu.bootloader.uart2_alternative.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}

